export const case_list: any[] = [
    { id: 3, name: '악성댓글', src: '3' },
    { id: 5, name: '익명', src: '5' },
    { id: 2, name: '기프티콘', src: '2' },
    { id: 4, name: '사진', src: '4' },
    { id: 1, name: '상태메세지', src: '1' },
    { id: 6, name: '주작(거짓)', src: '6' }
]

export const case_quiz1 = {
    messages: [
        {
            id: 1, name: '상태메세지', data: [
                { id: 1, name: '사건카드 1', text: '강부장과 같은 반인 B반 학생 3명은 강부장의 사진을 자신들의 메신저 프로필 사진으로 교체하면서 따돌림을 주도했다.' },
                { id: 2, name: '사건카드 2', text: '김대리는 상태 메시지를 "우리반 ㅇㄸ 10130", "ㄱㅂㅈ" 등으로 설정했다.' },
                { id: 3, name: '사건카드 3', text: 'B반 학생 2명은 다른 학급 친구들에게 ‘강부장을 인싸로 만들자’는 이야기를 하며, 굴욕사진을 프로필 사진으로 설정할 것을 강요하였다.' },
                { id: 4, name: '사건카드 4', text: 'B반에는 강부장의 사진을 프로필 사진으로 설정하는 문화가 생겨 너도나도 강부장의 사진을 몰래 찍기 시작했다. 강부장은 사진이 찍히고 있는 걸 전혀 몰랐고 자신이 모르는 사이에 찍힌 사진들이 B반 친구들의 프로필 사진으로 걸리는 것을 보며 불안과 공포감을 호소했다.' },
                { id: 5, name: '사건카드 5', text: 'B반 학생 1명은 강부장의 사진을 다른 학교 학생들과 함께 있는 단체 채팅방에 게시했다. 사진 속의 강부장은 교복을 입고 있었기 때문에 학교와 이름이 금방 채팅방에서 언급되었다.' },
            ]
        },
        {
            id: 2, name: '기프티콘', data: [
                { id: 1, name: '사건카드 1', text: '김바둑은 김영희에게 일주일 후에 현금으로 줄 테니 편의점에서 사용할 수 있는 기프티콘을 구매해달라고 지속적으로 요구했다. 김영희는 본인이 사용하겠다고 거짓말을 해서 부모님께 기프티콘 구입을 요청했고, 구입한 기프티콘을 김바둑에게 전송했다. 김바둑은 일주일 후에 주겠다는 약속을 지키지 않았고 한꺼번에 주겠다며 추가 전송을 요구했다.' },
                { id: 2, name: '사건카드 2', text: '김영희, 김바둑과 같은 반인 친구 3명은 김영희가 김바둑에게 기프티콘을 전송하는 것을 보고 김영희에게 자신들에게도 기프티콘을 보내라고 요구했다. 김영희가 김바둑을 포함한 총 4인에게 전달한 기프티콘의 금액은 한 달 동안 100,000원 이상이었다.' },
                { id: 3, name: '사건카드 3', text: '김영희가 기프티콘 전송을 거부하자 김바둑은 김영희와의 1:1 채팅방에서 ‘비겁해’, ‘쪼잔해’, ‘의리없어’ 등의 메시지를 한 달 동안 수시로 보냈다.' },
                { id: 4, name: '사건카드 4', text: '김바둑과 김바둑의 친구 3인은 김영희가 결제 거부 의사를 밝히면서 그룹채팅방을 만들어 김영희를 초대해 조롱하는 말을 남겼고 김영희가 채팅방을 나가면 반복적으로 초대했다.' },
                { id: 5, name: '사건카드 5', text: '김바둑과 친구들은 김영희가 전송한 기프티콘으로 편의점에서 간식을 사먹으면서 개인 SNS에 김영희를 암시하는 단어와 함께 #호구 등과 같은 단어를 해시태그했다.' }
            ]
        },
        {
            id: 3, name: '악성댓글', data: [
                { id: 1, name: '사건카드 1', text: '신기해는 이평범의 사진에 “성형수술했어?”라는 댓글을 달았고 이평범이 반박하자 자신의 SNS에 이평범의 1년 전 사진과 현재 사진을 대조해 게시했다.' },
                { id: 2, name: '사건카드 2', text: '이평범은 신기해에게 사진을 내려달라고 했지만, 신기해는 1년 전 본인이 직접 찍은 사진이라며 내리기를 거부했다.' },
                { id: 3, name: '사건카드 3', text: '신기해는 ‘이평범의 과거 사진을 구합니다’라는 제목으로 누구나 볼 수 있는 인터넷 게시판에 이평범의 개인정보(졸업한 학교, 사는 곳, SNS 주소 등)를 공개했다.' },
                { id: 4, name: '사건카드 4', text: '이평범은 자신의 SNS에 올린 사진을 삭제했으나, 신기해는 이평범이 업로드한 SNS 게시글과 댓글 등을 캡쳐 해놓았고 이를 학급 단체 채팅방에 공유했다.' },
                { id: 5, name: '사건카드 5', text: '이평범의 개인정보가 공개되면서, 이평범을 모르는 사람들이 ‘성괴 맞네!’, ‘귀척’ 등의 메시지를 지속적으로 보냈다.' }
            ]
        },
        {
            id: 4, name: '사진', data: [
                { id: 1, name: '사건카드 1', text: '장사과는 김멜론이 체육 시간을 앞두고 탈의하는 장면을 핸드폰 카메라로 촬영하고 오픈 채팅방에 신상정보와 함께 공유했다.' },
                { id: 2, name: '사건카드 2', text: '오픈 채팅방에 있던 56명 중 일부는 받은 사진을 지인들에게 공유하며, 모욕적인 이야기를 나눴다.' },
                { id: 3, name: '사건카드 3', text: '오픈 채팅방에 있던 이포도는 김멜론의 사진을 다른 사진과 합성하여, 모두가 볼 수 있는 SNS에 ‘#누드 체육복’이라는 해시태그와 함께 게시하였다.' },
                { id: 4, name: '사건카드 4', text: '이포도는 오픈 채팅방에서 확보한 신상정보를 토대로 김멜론의 등하교 시간에 맞춰서 “사진을 유포하겠다”는 SNS 메시지를 보냈다.' },
                { id: 5, name: '사건카드 5', text: '박자몽은 오픈 채팅방에서 공유받은 김멜론의 사진을 채팅앱의 프로필 사진으로 게시했다.' }
            ]
        },
        {
            id: 5, name: '익명', data: [

                { id: 1, name: '사건카드 1', text: '김공책은 한연필이 여자친구를 구한다는 메시지와 함께 SNS 주소를 게시하였다.' },
                { id: 2, name: '사건카드 2', text: '박필통은 한연필 SNS 주소를 확인하고 만나자는 메시지를 보냈고, “관심없다”는 답변에도 지속적으로 만나자는 메시지를 보냈다.' },
                { id: 3, name: '사건카드 3', text: '김공책은 한연필과의 대화 중 일부를 편집하여 “세인중학교 한연필 인성 논란”이라는 게시글과 함께 이미지를 올렸다.' },
                { id: 4, name: '사건카드 4', text: '익명 게시판을 이용하는 사용자 30여 명은 김공책이 올린 게시글에 ‘좋아요’를 누르며, 본인들의 SNS로 공유했다.' },
                { id: 5, name: '사건카드 5', text: '익명 게시판을 이용하는 사용자 2명은 한연필 SNS에서 한연필 사진을 다운로드 받아 게시하면서 “이 얼굴로 여친을 구한다고?”, “제정신임?” 등 게시글을 작성했다.' }
            ]
        },
        {
            id: 6, name: '주작(거짓)', data: [
                { id: 1, name: '사건카드 1', text: '양스타 채널의 구독자인 이독자는 양스타의 공식 SNS 계정이 아닌 비공식 SNS 계정을 알고 싶어졌다. 이독자는 양스타의  영상 속에 잠시 스친 교복을 보고 학교를 추측해서 비공식 계정을 발견하고 업로드된 모든 사진에 ‘크리에이터 양스타 맞죠?’라는 댓글을 달아 불안감을 조성했다.' },
                { id: 2, name: '사건카드 2', text: '이독자는 양스타의 비공식 계정을 살펴보다가 방송에 출연했던 고양이가 길냥이가 아니라 양스타가 오래 전부터 길러온 고양이라는 걸 알게 되었다. 이독자는 양스타의 SNS에서 고양이와 함께 찍은 셀카를 캡처해서 ‘주작 방송한 크리에이터 신상공개’라는 제목으로 인터넷 게시판에 올렸다.' },
                { id: 3, name: '사건카드 3', text: '이독자의 ‘주작 방송한 크리에이터 신상공개’ 게시물은 조회 수가 폭증했고 게시물에는 수많은 댓글이 달렸다. 그중 대다수는 ‘이 세상에서 없어져라’와 같은 폭력적인 댓글이 대다수였다.' },
                { id: 4, name: '사건카드 4', text: '크리에이터 박영상은 양스타를 퇴출시켜야 한다는 내용으로 영상을 만들어 공개했으며 영상 안에는 양스타의 이름과 학교, 사는 곳 등이 반복적으로 등장했다.' },
                { id: 5, name: '사건카드 5', text: '크리에이터 박영상은 양스타에게 ‘영상을 내려줄테니 돈을 보내라.’, ‘직접 만나주면 삭제하겠다’ 등의 DM을 보냈고 양스타는 거절했지만 DM 보내기를 멈추지 않았다.' }
            ]
        }
    ],
    plaintiff: [
        { id: 1, name: '상태메세지', src: '1' },
        { id: 2, name: '기프티콘', src: '2' },
        { id: 3, name: '악성댓글', src: '3' },
        { id: 4, name: '사진', src: '4' },
        { id: 5, name: '익명', src: '5' },
        { id: 6, name: '주작(거짓)', src: '6' }
    ],
    defendant: [
        {
            id: 1,
            name: '상태메세지',
            incidents: [
                { id: 1, src: '1/1' },
                { id: 2, src: '1/2' },
                { id: 3, src: '1/3' },
                { id: 4, src: '1/4' },
                { id: 5, src: '1/5' }
            ]
        },
        {
            id: 2,
            name: '기프티콘',
            incidents: [
                { id: 1, src: '2/6' },
                { id: 2, src: '2/7' },
                { id: 3, src: '2/8' },
                { id: 4, src: '2/9' },
                { id: 5, src: '2/10' }
            ]
        },
        {
            id: 3,
            name: '악성댓글',
            incidents: [
                { id: 1, src: '3/11' },
                { id: 2, src: '3/12' },
                { id: 3, src: '3/13' },
                { id: 4, src: '3/14' },
                { id: 5, src: '3/15' }
            ]
        },
        {
            id: 4,
            name: '사진',
            incidents: [
                { id: 1, src: '4/16' },
                { id: 2, src: '4/17' },
                { id: 3, src: '4/18' },
                { id: 4, src: '4/19' },
                { id: 5, src: '4/20' }
            ]
        },
        {
            id: 5,
            name: '익명',
            incidents: [
                { id: 1, src: '5/21' },
                { id: 2, src: '5/22' },
                { id: 3, src: '5/23' },
                { id: 4, src: '5/24' },
                { id: 5, src: '5/25' }
            ]
        },
        {
            id: 6,
            name: '주작(거짓)',
            incidents: [
                { id: 1, src: '6/26' },
                { id: 2, src: '6/27' },
                { id: 3, src: '6/28' },
                { id: 4, src: '6/29' },
                { id: 5, src: '6/30' }
            ]
        }
    ]
}

export const case_quiz2 = [
    { id: 0, name: '사이버 언어폭력', src: 'a', text: '모두가 볼 수 있는 인터넷, 핸드폰 문자 서비스 등을 통해 욕설, 거친 언어, 인신 공격적 발언을 남기는 행위는 사이버 언어폭력이며 모욕죄에 해당한다.' },
    { id: 1, name: '사이버 명예훼손', src: 'b', text: '모두가 볼 수 있는 인터넷, SNS 등에 사람의 명예를 훼손시킬만한 사실을 공개하는 경우 사이버 명예훼손 죄에 해당한다. 이때 공개한 내용이 사실이거나 거짓이어도 모두 명예훼손으로 처벌받을 수 있다.' },
    { id: 2, name: '사이버 스토킹', src: 'c', text: '상대방에게 반복적으로 공포감, 불안감을 유발하는 이메일이나 쪽지를 보내거나 블로그, SNS 등에 방문하여 댓글 혹은 좋아요를 눌러 관찰하고 있음을 알리는 행위는 사이버 스토킹으로 처벌받을 수 있다.' },
    { id: 3, name: '사이버 성폭력', src: 'd', text: '성적인 묘사 혹은 성적 비하 발언, 성차별적 욕설 등 성적 불쾌감을 느낄 수 있는 내용을 인터넷이나 핸드폰을 통해 많은 사람들이 볼 수 있는 곳에 공개하거나 음란한 동영상, 사진을 퍼뜨리는 행위는 사이버 성폭력으로 처벌받을 수 있다.' },
    { id: 4, name: '신상정보 유출', src: 'e', text: '모두가 볼 수 있는 공간에 개인의 사생활을 언급하거나 신상정보에 해당하는 내용을 퍼뜨리는 행위는 개인정보 보호법에 따라 처벌받을 수 있다. 신상정보에는 이름이나 거주지, 재학 중인 학교, 사진 등이 포함된다.' },
    { id: 5, name: '사이버 따돌림', src: 'f', text: '인터넷이나 SNS 등에서 한 사람을 따돌리거나 안티 활동을 하는 행위는 사이버 따돌림으로 판단한다.' },
    { id: 6, name: '사이버 갈취', src: 'g', text: '사이버 머니, 스마트폰 데이터, 게임 아이템 등을 강제로 뺏은 행위는 절도죄로 처벌받을 수 있다.' },
    { id: 7, name: '사이버 강요', src: 'h', text: '인터넷이나 핸드폰을 이용해 상대방이 원치 않는 행동을 하도록 협박하는 것은 사이버 강요에 해당한다.' }
]

export const case_quiz3 = [
    {
        id: 1,
        name: '학교폭력예방 및 대책에 관한 법률',
        data: [
            {
                id: 1,
                name: '학교폭력예방법 제 17조',
                text: `
학교폭력대책심의위원회는 피해학생의 보호와 가해학생의 선도 및 교육을 위해 다음 조치 중 하나 혹은 하나 이상의 조치를 하도록 학교장에게 요청해야 한다. 단, 퇴학처분은 의무교육과정을 마치지 못했다면 가해학생에게 퇴학처분을 적용할 수 없다.

①  피해학생에 대한 사과문 제출
②  피해학생 및 신고 · 고발 학생에 대한 접촉, 협박 및 보복행위의 금지
③  학교에서의 봉사
④  사회봉사
⑤  학내외 전문가에 의한 특별 교육이수 또는 심리치료
⑥  출석정지
⑦  학급 교체
⑧  전학
⑨  퇴학 처분
`
            }
        ]
    },
    {
        id: 2,
        name: '형법',
        data: [
            {
                id: 1,
                name: '권리행사를 방해하는 죄 | 형법 제324조 1항',
                text: `폭행 또는 협박으로 사람의 권리행사를 방해하거나 해야 할 의무가 없는 일을 하게 강요한 자는 5년 이하의 징역 또는 3천만원 이하의 벌금에 처한다.`
            },
            {
                id: 2,
                name: '명예에 관한 죄 | 형법 제307조 1항',
                text: `다른 사람이 볼 수 있는 곳에 있는 사실 그대로를 알려서 사람의 명예를 훼손한 자는 2년 이하의 징역 또는 500만원 이하의 벌금에 처한다.`
            },
            {
                id: 3,
                name: '명예에 관한 죄 | 형법 제307조 2항',
                text: `다른 사람이 알 수 있도록 사실이 아닌 내용을 알려서 사람의 명예를 훼손한 자는 5년 이하의 징역 또는 1천만원 이하의 벌금에 처한다.`
            },
            {
                id: 4,
                name: '명예에 관한 죄 | 형법 제311조',
                text: `다른 사람이 볼 수 있는 곳에서 사람을 모욕한 자는 1년 이하의 징역 또는 200만원 이하의 벌금에 처한다.`
            },
            {
                id: 5,
                name: '절도와 강도의 죄 | 형법 제329조',
                text: `다른 사람의 돈이나 물건 등 재물을 빼앗은 자는 6년 이하의 징역 또는 1천만원 이하의 벌금에 처한다.`
            }
        ]
    },
    {
        id: 3,
        name: '정보통신망 이용촉진 및 정보보호 등에 관한 법률',
        data: [
            {
                id: 1,
                name: '정보통신망법 제70조 1항',
                text: `사람을 비방할 목적으로 다른 사람이 볼 수 있는 정보통신망에 사실을 드러내어 사람의 명예를 훼손한 자는 3년 이하의 징역 또는 3천만원 이하의 벌금에 처한다.`
            },
            {
                id: 2,
                name: '정보통신망법 제70조 2항',
                text: `사람을 비방할 목적으로 다른 사람이 볼 수 있는 정보통신망에 거짓의 사실을 드러내어 사람의 명예를 훼손한 자는 7년 이하의 징역 또는 5천만원 이하의 벌금에 처한다.`
            },
            {
                id: 3,
                name: '정보통신망법 제74조',
                text: `
다음에 해당하는 자는 1년 이하의 징역 또는 1천만원 이하의 벌금에 처한다.

① 음란한 부호 · 문언 · 음향 · 화상 또는 영상을 배포 · 판매 임대하거나 모두가 볼 수 있는 곳에 공개한 자 
*  이모티콘, 자음, 모음, 초성, 댓글, 사진, 그림, 음성 파일, 동영상 등을 포함한다. 
② 공포심이나 불안감을 유발하는 부호 · 문언 · 음향 · 화상 또는 영상을 반복적으로 상대방에게 보낸 자
`
            }
        ]
    },
    {
        id: 4,
        name: '경범죄 처벌법',
        data: [
            {
                id: 1,
                name: '경범죄 처벌법 제3조 1항',
                text: '다른 사람에게 지속적으로 접근하거나 직접적인 만남 또는 교제를 요구하는 자,  다른 사람을 지켜보거나 따라다니며 괴롭히는 자, 잠복하여 기다리는 자는 다른 사람을 지속적으로 괴롭혔다고 판단하여 10만원 이하의 벌금에 처한다.'
            }
        ]
    },
    {
        id: 5,
        name: '개인정보 보호법',
        data: [
            {
                id: 1,
                name: '개인정보 보호법 제71조',
                text: `
다음에 해당하는 자는 5년 이하의 징역 또는 5천만원 이하의 벌금에 처한다.
① 상대방의 동의를 받지 않고 개인정보와 신상을 수집하거나 다른 사람에게 제공한 자 
② 상대방의 개인정보와 신상을 개인정보를 돈을 벌기 위해 또는 기타 다른 부정한 목적으로 제공받은 자
③ 법정 대리인의 동의를 받지 아니하거나 법정 대리인이 동의하였는지를 확인하지 않고 만 14세 미만인 아동의 개인정보를 수집한 자
④ 다른 사람의 개인정보 또는 신상을 훼손하거나 변경 및 유출한 자
`
            },
        ]
    },
    {
        id: 6,
        name: '성폭력범죄의 처벌 등에 관한 특례법',
        data: [
            {
                id: 1,
                name: '성폭력처벌법 제13조',
                text: '자신 또는 다른 사람의 성적 욕망을 유발하거나 만족시킬 목적으로 전화, 우편, 컴퓨터, 그 밖의 통신매체를 통하여 성적 수치심이나 혐오감을 일으키는 말, 음향, 글, 그림, 영상 또는 물건을 상대방에게 보낸 사람은 2년 이하의 징역 또는 2천만원 이하의 벌금에 처한다.'
            },
            {
                id: 2,
                name: '성폭력처벌법 제14조 1항',
                text: '카메라나 그 밖에 이와 유사한 기능을 갖춘 기계장치를 이용하여 성적 욕망 또는 수치심을 유발할 수 있는 사람의 신체를 촬영 대상자의 의사에 반하여 촬영한 자는 7년 이하의 징역 또는 5천만원 이하의 벌금에 처한다.'
            },
            {
                id: 3,
                name: '성폭력처벌법 제14조의 2 1항',
                text: '유포를 목적으로 사람의 얼굴ㆍ신체 또는 음성을 대상으로 한 촬영물ㆍ영상물 또는 음성물을 성적 욕망 또는 수치심을 유발할 수 있는 형태로 편집ㆍ합성 또는 가공한 자는 5년 이하의 징역 또는 5천만원 이하의 벌금에 처한다.'
            }
        ]
    },
]

export const lawPenals = [
    {
        name: '명예에 관한 죄 | 형법 제307조 1항',
        prison: 24,
        fine: 500
    },
    {
        name: '명예에 관한 죄 | 형법 제307조 2항',
        prison: 60,
        fine: 1000
    },
    {
        name: '명예에 관한 죄 | 형법 제311조',
        prison: 12,
        fine: 200
    },
    {
        name: '권리행사를 방해하는 죄 | 형법 제324조 1항',
        prison: 60,
        fine: 3000
    },
    {
        name: '절도와 강도의 죄 | 형법 제329조',
        prison: 72,
        fine: 1000
    },
    {
        name: '경범죄 처벌법 제3조 1항',
        prison: 0,
        fine: 10
    },
    {
        name: '정보통신망법 제70조 1항',
        prison: 36,
        fine: 3000
    },
    {
        name: '정보통신망법 제70조 2항',
        prison: 84,
        fine: 5000
    },
    {
        name: '정보통신망법 제74조',
        prison: 12,
        fine: 1000
    },
    {
        name: '개인정보 보호법 제71조',
        prison: 60,
        fine: 5000
    },
    {
        name: '성폭력처벌법 제13조',
        prison: 24,
        fine: 2000
    },
    {
        name: '성폭력처벌법 제14조 1항',
        prison: 84,
        fine: 5000
    },
    {
        name: '성폭력처벌법 제14조의 2 1항',
        prison: 60,
        fine: 5000
    }
]

export const young_penalty = [
    { id: 1, name: '피해학생에 대한 서면사과' },
    { id: 2, name: '피해학생 및 신고고발 학생에 대한 접촉, 협박 및 보복행위의 금지' },
    { id: 3, name: '학교에서의 봉사' },
    { id: 4, name: '사회봉사' },
    { id: 5, name: '학내외 전문가에 의한 특별 교육이수 또는 심리치료' },
    { id: 6, name: '출석 정지' },
    { id: 7, name: '학급 교체' },
    { id: 8, name: '전학' },
    { id: 9, name: '퇴학처분' }
]

export const people_list = [
    {
        id: 1, name: '상태메세지', src: 'recovery_1', data: [
            { id: 1, name: 'B반 학생 3명 (14세, 남)', src: 'law_1_1' },
            { id: 2, name: '김대리 (14세, 남)', src: 'law_1_2' },
            { id: 3, name: 'B반 학생 2명 (14세, 남/여)', src: 'law_1_3' },
            { id: 4, name: 'B반 (14세, 여/남)', src: 'law_1_4' },
            { id: 5, name: 'B반 학생 1명 (14세, 남)', src: 'law_1_5' }
        ]
    },
    {
        id: 2, name: '기프티콘', src: 'recovery_2', data: [
            { id: 1, name: '김바둑 (16세, 남)', src: 'law_2_1' },
            { id: 2, name: '같은 반 친구 3명 (16세, 남/여)', src: 'law_2_2' },
            { id: 3, name: '김바둑 (16세, 남)', src: 'law_2_3' },
            { id: 4, name: '김바둑 외 3명 (16세, 남/여)', src: 'law_2_4' },
            { id: 5, name: '김바둑과 같은 반 친구들 (16세, 남/여)', src: 'law_2_5' }
        ]
    },
    {
        id: 3, name: '악성댓글', src: 'recovery_3', data: [
            { id: 1, name: '신기해 (17세, 남)', src: 'law_3_1' },
            { id: 2, name: '신기해 (17세, 남)', src: 'law_3_2' },
            { id: 3, name: '신기해 (17세, 남)', src: 'law_3_3' },
            { id: 4, name: '신기해 (17세, 남)', src: 'law_3_4' },
            { id: 5, name: '알 수 없는 사람들 (남/여)', src: 'law_3_5' }
        ]
    },
    {
        id: 4, name: '사진', src: 'recovery_4', data: [
            { id: 1, name: '장사과 (15세, 남)', src: 'law_4_1' },
            { id: 2, name: '오픈 채팅방 56명 (남/여)', src: 'law_4_2' },
            { id: 3, name: '이포도 (21세, 남)', src: 'law_4_3' },
            { id: 4, name: '이포도 (21세, 남)', src: 'law_4_4' },
            { id: 5, name: '박자몽 (15세, 남)', src: 'law_4_5' }
        ]
    },
    {
        id: 5, name: '익명', src: 'recovery_5', data: [
            { id: 1, name: '김공책 (15세, 여)', src: 'law_5_1' },
            { id: 2, name: '박필통 (15세, 여)', src: 'law_5_2' },
            { id: 3, name: '김공책 (15세, 여)', src: 'law_5_3' },
            { id: 4, name: '익명 게시판 30명 (남/여)', src: 'law_5_4' },
            { id: 5, name: '익명 게시판 2명 (남/여)', src: 'law_5_5' }
        ]
    },
    {
        id: 6, name: '주작(거짓)', src: 'recovery_6', data: [
            { id: 1, name: '이독자 (16세, 여)', src: 'law_6_1' },
            { id: 2, name: '이독자 (16세, 여)', src: 'law_6_2' },
            { id: 3, name: '게시판 네티즌 (남/여)', src: 'law_6_3' },
            { id: 4, name: '박영상 (16세, 남)', src: 'law_6_4' },
            { id: 5, name: '박영상 (16세, 남)', src: 'law_6_5' }
        ]
    }
]

export const to_defendant = [
    { id: 1, name: '원고에게 진심어린 사과를 하세요.' },
    { id: 2, name: '같은 행동을 하지 않겠다고 약속하세요.' },
    { id: 3, name: '판결 내용을 평생 기억하세요.' }
]

export const to_plaintiff = [
    { id: 1, name: '누구에게나 일어날 수 있는 일이 있어요' },
    { id: 2, name: '2차 가해가 있다면 신고하세요' },
    { id: 3, name: '잘못은 상대방에게 있어요' }
]

export const to_recovery = [
    { // 상태 메세지
        id: 1, data: [
            { id: 1, name: '같은 반 친구들이 저를 따돌렸다는 게 너무 속상해요.' },
            { id: 2, name: '따돌림을 막으려 했던 친구들이 있었다는 걸 알고 싶어요.' },
            { id: 3, name: '어디선가 나를 찍고 있을 지도 모른다는 생각이 지워지지 않습니다.' },
            { id: 4, name: '소송 비용과 심리 치료 비용이 많이 들어서 부모님께 죄송한 마음이 들어요.' },
            { id: 5, name: '인터넷에 떠도는 제 사진을 지워주세요.' }
        ]
    },
    { // 기프티콘
        id: 2, data: [
            { id: 1, name: '저를 쪼잔하다고 했던 메시지 때문에 제가 진짜 그런 사람이 된 것 같아요,' },
            { id: 2, name: '부모님에게 거짓말로 용돈을 받아서 기프티콘을 결제했어요. 거짓말한 걸 용서해 주실까요?' },
            { id: 3, name: '다시는 똑같은 일을 저지르지 않는다는 다짐을 받고 싶어요.' },
            { id: 4, name: '뺏긴 돈을 돌려받으면 그동안 저와 함께 힘써 주신 분들을 위해 쓰고 싶어요,' },
            { id: 5, name: 'SNS에 떠도는 저에 관한 해시태그를 지워주세요.' }
        ]
    },
    { // 악성댓글
        id: 3, data: [
            { id: 1, name: '길거리에 나가면 다 제 얼굴만 보는 것 같아요.' },
            { id: 2, name: '외모와 관계 없이 저를 평범하게 대해 줄 친구가 없는 것 같아요.' },
            { id: 3, name: '제 사진을 허락 없이 저장하는 사람들도 처벌할 수 없을까요?' },
            { id: 4, name: '잠시 SNS는 멀리하고 다른 취미를 만들어보려고 합니다.' },
            { id: 5, name: '인터넷에 떠도는 제 신상정보를 다 지워주세요.' }
        ]
    },
    { // 사진
        id: 4, data: [
            { id: 1, name: '다른 사람이 핸드폰만 만져도 두려워요,' },
            { id: 2, name: '다들 별 거 아닌 것처럼 행동하는 것 같은데 자기 일처럼 생각해 주면 좋겠어요,' },
            { id: 3, name: '저를 스토킹한 사람이 더 무거운 처벌을 받기를 희망합니다.' },
            { id: 4, name: '제 사진이 어디까지 퍼졌는지 조사할 수 있도록 전문가를 고용하고 싶습니다.' },
            { id: 5, name: '합성 사진이 완전히 사라질 수 있을까요?' }
        ]
    }, // 익명
    {
        id: 5, data: [
            { id: 1, name: '친한 친구가 저에게 악의를 품고 있었다는 걸 받아들이기 힘들어요.' },
            { id: 2, name: '친구들이 메시지를 보내도 편집할 수도 있다는 생각에 답장을 못하겠어요.' },
            { id: 3, name: '거짓말을 사실처럼 퍼뜨린 사람들이 더 무거운 처벌을 받아야 한다고 생각해요.' },
            { id: 4, name: '학교도 옮기고 싶고 이사도 가고 싶어요.' },
            { id: 5, name: '익명 게시판에 있는 저에 대한 이야기를 다 지워주세요.' }
        ]
    },
    // 주작(거짓)
    {
        id: 6, data: [
            { id: 1, name: '제 잘못에서 시작된 일이지만 악플은 견디기 힘들어요.' },
            { id: 2, name: '모든 사람들이 저를 비난해요. 제 편이 아직 남아 있을까요?”' },
            { id: 3, name: '제 사진으로 모아서 영상으로 만든 사람은 따로 처벌하고 싶어요,' },
            { id: 4, name: '다시 영상을 만들 수 있다면 정말 좋은 일을 할 거예요.' },
            { id: 5, name: '저에 대한 신상정보가 담긴 악플과 영상을 모두 삭제하고 싶습니다.' }
        ]
    }
]

const INCIDENT_TYPE_LIST = [
    '사이버 언어폭력',   // 0
    '사이버 명예훼손',   // 1
    '사이버 스토킹',     // 2
    '사이버 성폭력',     // 3
    '신상정보 유출',     // 4
    '사이버 따돌림',     // 5
    '사이버 갈취',      // 6
    '사이버 강요'       // 7
]

export const incident_type_right = [
    {
        id: 1, data: [
            { id: 1, type: INCIDENT_TYPE_LIST[5] },
            { id: 2, type: INCIDENT_TYPE_LIST[0] },
            { id: 3, type: INCIDENT_TYPE_LIST[7] },
            { id: 4, type: INCIDENT_TYPE_LIST[2] },
            { id: 5, type: INCIDENT_TYPE_LIST[4] }
        ]
    },
    {
        id: 2, data: [
            { id: 1, type: INCIDENT_TYPE_LIST[6] },
            { id: 2, type: INCIDENT_TYPE_LIST[6] },
            { id: 3, type: INCIDENT_TYPE_LIST[0] },
            { id: 4, type: INCIDENT_TYPE_LIST[5] },
            { id: 5, type: INCIDENT_TYPE_LIST[1] }
        ]
    },
    {
        id: 3, data: [
            { id: 1, type: INCIDENT_TYPE_LIST[1] },
            { id: 2, type: INCIDENT_TYPE_LIST[4] },
            { id: 3, type: INCIDENT_TYPE_LIST[4] },
            { id: 4, type: INCIDENT_TYPE_LIST[5] },
            { id: 5, type: INCIDENT_TYPE_LIST[0] }
        ]
    },
    {
        id: 4, data: [
            { id: 1, type: INCIDENT_TYPE_LIST[3] },
            { id: 2, type: INCIDENT_TYPE_LIST[3] },
            { id: 3, type: INCIDENT_TYPE_LIST[3] },
            { id: 4, type: INCIDENT_TYPE_LIST[2] },
            { id: 5, type: INCIDENT_TYPE_LIST[4] }
        ]
    },
    {
        id: 5, data: [
            { id: 1, type: INCIDENT_TYPE_LIST[4] },
            { id: 2, type: INCIDENT_TYPE_LIST[2] },
            { id: 3, type: INCIDENT_TYPE_LIST[1] },
            { id: 4, type: INCIDENT_TYPE_LIST[1] },
            { id: 5, type: INCIDENT_TYPE_LIST[0] }
        ]
    },
    {
        id: 6, data: [
            { id: 1, type: INCIDENT_TYPE_LIST[2] },
            { id: 2, type: INCIDENT_TYPE_LIST[4] },
            { id: 3, type: INCIDENT_TYPE_LIST[0] },
            { id: 4, type: INCIDENT_TYPE_LIST[4] },
            { id: 5, type: INCIDENT_TYPE_LIST[7] }
        ]
    }
]

const LAW_LIST = [
    '학교폭력예방법 제 17조',                   // 0
    '권리행사를 방해하는 죄 | 형법 제324조 1항',   // 1
    '명예에 관한 죄 | 형법 제307조 1항',         // 2
    '명예에 관한 죄 | 형법 제307조 2항',         // 3
    '명예에 관한 죄 | 형법 제311조',            // 4
    '절도와 강도의 죄 | 형법 제329조',           // 5
    '정보통신망법 제70조 1항',                  // 6
    '정보통신망법 제70조 2항',                  // 7
    '정보통신망법 제74조',                     // 8
    '경범죄 처벌법 제3조 1항',                  // 9
    '개인정보 보호법 제71조',                   // 10
    '성폭력처벌법 제13조',                     // 11 
    '성폭력처벌법 제14조 1항',                 // 12
    '성폭력처벌법 제14조의 2 1항'               // 13
]


export const law_right = [
    {//상태메세지
        id: 1, data: [
            { id: 1, right: [LAW_LIST[0],], similar: [LAW_LIST[4], LAW_LIST[8], LAW_LIST[10],] },
            { id: 2, right: [LAW_LIST[0], LAW_LIST[4],], similar: [LAW_LIST[3], LAW_LIST[7], LAW_LIST[8],] },
            { id: 3, right: [LAW_LIST[0], LAW_LIST[1],], similar: [LAW_LIST[3], LAW_LIST[7], LAW_LIST[8],] },
            { id: 4, right: [LAW_LIST[0], LAW_LIST[8], LAW_LIST[9],], similar: [LAW_LIST[3], LAW_LIST[7], LAW_LIST[10],] },
            { id: 5, right: [LAW_LIST[0], LAW_LIST[10],], similar: [LAW_LIST[9],] }
        ]
    },
    {//기프티콘
        id: 2, data: [
            { id: 1, right: [LAW_LIST[0], LAW_LIST[5],], similar: [LAW_LIST[1],] },
            { id: 2, right: [LAW_LIST[0], LAW_LIST[5],], similar: [LAW_LIST[1],] },
            { id: 3, right: [LAW_LIST[0], LAW_LIST[4],], similar: [LAW_LIST[2], LAW_LIST[6], LAW_LIST[8],] },
            { id: 4, right: [LAW_LIST[0],], similar: [LAW_LIST[8], LAW_LIST[9],] },
            { id: 5, right: [LAW_LIST[0], LAW_LIST[2], LAW_LIST[6],], similar: [LAW_LIST[3], LAW_LIST[4],] }
        ]
    },
    {//악성댓글
        id: 3, data: [
            { id: 1, right: [LAW_LIST[0], LAW_LIST[3], LAW_LIST[7],], similar: [LAW_LIST[2], LAW_LIST[4], LAW_LIST[6], LAW_LIST[8], LAW_LIST[11],] },
            { id: 2, right: [LAW_LIST[0], LAW_LIST[10],], similar: [LAW_LIST[1], LAW_LIST[8], LAW_LIST[9],] },
            { id: 3, right: [LAW_LIST[0], LAW_LIST[10],], similar: [LAW_LIST[1], LAW_LIST[8], LAW_LIST[9],] },
            { id: 4, right: [LAW_LIST[0],], similar: [LAW_LIST[10],] },
            { id: 5, right: [LAW_LIST[4],], similar: [LAW_LIST[0], LAW_LIST[3], LAW_LIST[7], LAW_LIST[7], LAW_LIST[8],] }
        ]
    },
    {//사진
        id: 4, data: [
            { id: 1, right: [LAW_LIST[8], LAW_LIST[11], LAW_LIST[12],], similar: [LAW_LIST[0], LAW_LIST[2], LAW_LIST[3], LAW_LIST[4], LAW_LIST[6], LAW_LIST[7], LAW_LIST[10],] },
            { id: 2, right: [LAW_LIST[8], LAW_LIST[11],], similar: [LAW_LIST[2], LAW_LIST[3], LAW_LIST[4], LAW_LIST[6], LAW_LIST[7],] },
            { id: 3, right: [LAW_LIST[8], LAW_LIST[11], LAW_LIST[13],], similar: [LAW_LIST[2], LAW_LIST[3], LAW_LIST[4], LAW_LIST[6], LAW_LIST[7],] },
            { id: 4, right: [LAW_LIST[8], LAW_LIST[9],], similar: [LAW_LIST[1], LAW_LIST[10],] },
            { id: 5, right: [LAW_LIST[0], LAW_LIST[10],], similar: [LAW_LIST[8],] }
        ]
    },
    {//익명
        id: 5, data: [
            { id: 1, right: [LAW_LIST[0], LAW_LIST[10],], similar: [LAW_LIST[3], LAW_LIST[4], LAW_LIST[7]] },
            { id: 2, right: [LAW_LIST[0], LAW_LIST[8], LAW_LIST[9],], similar: [LAW_LIST[1],] },
            { id: 3, right: [LAW_LIST[0], LAW_LIST[3], LAW_LIST[7]], similar: [LAW_LIST[2], LAW_LIST[4], LAW_LIST[6], LAW_LIST[10],] },
            { id: 4, right: [LAW_LIST[0], LAW_LIST[3], LAW_LIST[7]], similar: [LAW_LIST[2], LAW_LIST[4], LAW_LIST[6], LAW_LIST[10],] },
            { id: 5, right: [LAW_LIST[0], LAW_LIST[4],], similar: [LAW_LIST[2], LAW_LIST[3], LAW_LIST[6], LAW_LIST[7]] }
        ]
    },
    {//주작(거짓)
        id: 6, data: [
            { id: 1, right: [LAW_LIST[8], LAW_LIST[9],], similar: [LAW_LIST[7], LAW_LIST[10],] },
            { id: 2, right: [LAW_LIST[10],], similar: [LAW_LIST[2], LAW_LIST[6],] },
            { id: 3, right: [LAW_LIST[4], LAW_LIST[7], LAW_LIST[8],], similar: [LAW_LIST[2], LAW_LIST[6],] },
            { id: 4, right: [LAW_LIST[7], LAW_LIST[10],], similar: [LAW_LIST[9],] },
            { id: 5, right: [LAW_LIST[8],], similar: [LAW_LIST[1], LAW_LIST[7],] }
        ]
    }
]